In [1]:
import pandas as pd

In [3]:
employees = {
    "imie" : ["Jan", "Piotr", "Paweł", "Adam"],
    "nazwisko" : ["Kowalski", "Nowak", "Zieliński", "Witkowski"],
    "rok urodzenia" : [1970, 1980, 1985, 1999]
}
employees

{'imie': ['Jan', 'Piotr', 'Paweł', 'Adam'],
 'nazwisko': ['Kowalski', 'Nowak', 'Zieliński', 'Witkowski'],
 'rok urodzenia': [1970, 1980, 1985, 1999]}

In [4]:
df = pd.DataFrame(employees)
df

    imie   nazwisko  rok urodzenia
0    Jan   Kowalski           1970
1  Piotr      Nowak           1980
2  Paweł  Zieliński           1985
3   Adam  Witkowski           1999

In [6]:
list(df.index)

[0, 1, 2, 3]

In [7]:
df.columns

Index(['imie', 'nazwisko', 'rok urodzenia'], dtype='object')

In [8]:
df.columns[2] = "rok_urodzenia"

TypeError: Index does not support mutable operations

In [9]:
df.columns = ["imie", "nazwisko", "rok_urodzenia"]
df.columns

Index(['imie', 'nazwisko', 'rok_urodzenia'], dtype='object')

In [10]:
df

    imie   nazwisko  rok_urodzenia
0    Jan   Kowalski           1970
1  Piotr      Nowak           1980
2  Paweł  Zieliński           1985
3   Adam  Witkowski           1999

In [11]:
df["imie"] # dostep do kolumny

0      Jan
1    Piotr
2    Paweł
3     Adam
Name: imie, dtype: object

In [12]:
type(df["imie"])

pandas.core.series.Series

In [13]:
df.imie

0      Jan
1    Piotr
2    Paweł
3     Adam
Name: imie, dtype: object

In [15]:
df[ ["nazwisko","imie"] ]

    nazwisko   imie
0   Kowalski    Jan
1      Nowak  Piotr
2  Zieliński  Paweł
3  Witkowski   Adam

In [19]:
df["wiek"] = 2021 - df["rok_urodzenia"]
df

    imie   nazwisko  rok_urodzenia  wiek
0    Jan   Kowalski           1970    51
1  Piotr      Nowak           1980    41
2  Paweł  Zieliński           1985    36
3   Adam  Witkowski           1999    22

In [21]:
del(df["wiek"])
df

    imie   nazwisko  rok_urodzenia
0    Jan   Kowalski           1970
1  Piotr      Nowak           1980
2  Paweł  Zieliński           1985
3   Adam  Witkowski           1999

In [22]:
from datetime import datetime

In [25]:
df["wiek"] = datetime.now().year - df["rok_urodzenia"]
df

    imie   nazwisko  rok_urodzenia  wiek
0    Jan   Kowalski           1970    51
1  Piotr      Nowak           1980    41
2  Paweł  Zieliński           1985    36
3   Adam  Witkowski           1999    22

In [26]:
df.values

array([['Jan', 'Kowalski', 1970, 51],
       ['Piotr', 'Nowak', 1980, 41],
       ['Paweł', 'Zieliński', 1985, 36],
       ['Adam', 'Witkowski', 1999, 22]], dtype=object)